#    -*- mode: org -*-

#+Title: Lección 9.B --- Tipos de interés a corto y largo plazo
#+author: Marcos Bujosa
#+LANGUAGE: es
#+OPTIONS: toc:nil
# +OPTIONS: author:nil
#+OPTIONS: date:nil

#+include: 00preambulo_practicas.txt

#+INFOJS_OPT: view:overview
# ###########
# ESTO DA EL FORMATO FINAL DE LA PÁGINA WEB VÉASE [[https://olmon.gitlab.io/org-themes/]]
#+SETUPFILE: ../css/bigblow_inline.theme
# ###########

#+name: setup-listings
#+begin_src emacs-lisp :exports none :results silent :tangle no
  (setq org-latex-listings 'listings)
  (setq org-latex-custom-lang-environments
  	;'((emacs-lisp "common-lispcode")))
  	'((emacs-lisp "hansl-gretl")))
  (setq org-latex-listings-options
	'(("frame" "lines")
	  ("basicstyle" "\\scriptsize")
	  ("basicstyle" "\\ttfamily")
	  ("numbers=none" "left")
	  ("backgroundcolor=\\color{lightgray!20}")
	  ("numberstyle" "\\tiny")))
  (setq org-latex-to-pdf-process
	'("pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"))
  (org-add-link-type
   "latex" nil
   (lambda (path desc format)
     (cond
      ((eq format 'html)
       (format "<span class=\"%s\">%s</span>" path desc))
      ((eq format 'latex)
       (format "\\%s{%s}" path desc)))))
#+end_src

#+NAME: if-no--guiones-makefir
#+BEGIN_SRC emacs-lisp :exports none :results silent :tangle no
(unless (file-directory-p "guiones")
  (make-directory "guiones"))
#+END_SRC

#+NAME: tangle-all-code-blocks
#+BEGIN_SRC emacs-lisp :exports none :results silent :tangle no
(org-babel-tangle)
#+END_SRC

#+begin_src emacs-lisp :results silent :exports none
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((latex . t)))
#+end_src


#+name: execute-gretl-practice
#+PROPERTY: P-L09-B-TiposDeInteresACortoYLargo
#+BEGIN_SRC sh  :exports none  :results silent :var practica="P-L09-B-TiposDeInteresACortoYLargo"
rm -fr $(pwd)/$practica
**** para los tipos a largo plazo

#+latex: {\vspace{0pt} \footnotesize \color{gray!70!black}
/o bien teclee en linea de comandos/:
#+begin_src gretl :tangle ./guiones/P-L09-B-TiposDeInteresACortoYLargo.inp :eval no 
adf 4 Long --c
#+end_src
#+latex: }

#+BEGIN_SRC R :tangle ./guiones/P-L09-B-TiposDeInteresACortoYLargo.inp :results none :eval no
outfile --quiet adf_Long.txt
    adf 4 Long --c
end outfile

outfile --quiet adf_Long_pvalue.txt
    printf "p-valor del contraste: =%.3f=\n", $pvalue
end outfile
#+END_SRC

#+latex: {\footnotesize
#+include: ./P-L09-B-TiposDeInteresACortoYLargo/adf_Long.txt example
#+latex: }

#+NAME: leer-valor
#+BEGIN_SRC sh :var file="./P-L09-B-TiposDeInteresACortoYLargo/adf_Long_pvalue.txt" :exports results :results output verbatim drawer
cat $file
#+END_SRC
  
#+RESULTS: leer-valor
:results:
p-valor del contraste: =0,940=
:end:
 
Así que no rechazamos la $H_0:$ /la serie es una realización de un proceso $I(1)$/ para =Long=.
  
